package com.company;

/**
 * Lefter Olexii, #18
 */
public class Main {
    /**
     * Дана последовательность чисел, среди которых имеется один нуль.
     * Вывести на экран все числа до нуля включительно.
     */
    private static void task40() {
        System.out.println("Task 40");

    }

    /**
     * Найти сумму наибольшего и наименьшего элементов массива вещественных чисел массива Z(n);
     */
    private static void task65() {
        System.out.println("\n\nTask 65");

    }

    /**
     * Дана непустая последовательность целых чисел, оканчивающаяся отрицательным числом.
     * Верно ли, что все элементы последовательности равны между собой?
     */
    private static void task90() {
        System.out.println("\n\nTask 90");

    }

    /**
     * На i-e место одномерного массива вещественных чисел вставить элемент,
     * равный квадратному корню из суммы квадратов двух введенных с клавиатуры элементов.
     */
    private static void task115() {
        System.out.println("\n\nTask 115");

    }

    /**
     * Дана последовательность целых чисел а1, а2, ..., an. Минимальный член этой последовательности заменить целой
     * частью среднего арифметического всех членов, остальные члены оставить без изменения.
     * Если в последовательности несколько минимальных членов, то заменить последний по порядку.
     */
    private static void task140() {
        System.out.println("\n\nTask 140");

    }

    public static void main(String[] args) {
        task40();
        task65();
        task90();
        task115();
        task140();
    }
}
